///*피라미드 뽑기*/
//#include <iostream>
//
//using namespace std;
//
//int main()
//{
//	/*
//			@
//		   @@@
//	      @@@@@
//		 @@@@@@@
//		이런식으로 뽑으라함
//	*/
//
//	int k;
//	cin >> k;
//
//	for (int i = 1; 2*i-1 <= k; i++)
//	{
//		for (int j = 1; j <= k; j++)
//		{
//			//수학적 파스타같아보여도... 명료하답니다
//			//왼쪽
//			if (2*j <= (k - 2*i + 1))
//			{
//				cout << "_";
//			}
//			//오른쪽
//			else if (2*j >= (k + 2 * i + 1))
//			{
//				cout << "_";
//			}
//			//별
//			else
//			{
//				//이거 if문 최상단에 올리면 최적화
//				cout << "*";
//			}
//		}
//		cout << endl;
//	}
//
//	
//	return 0;
//}